app/controllers/articles_controller.rb

	def create
		#render plain: params[:article].inspect

		@article = Article.new(article_params)

  		@article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "climate"], ["text", "Heavy rain in chennai"], ["created_at", "2015-11-19 10:52:31.215563"], ["updated_at", "2015-11-19 10:52:31.215563"]]